<h1>עזרה</h1>
<h2>מה חדש?</h2>
<ol>
	<li>ממשק חדש ויותר אינטואיטיבי</li>
	<li>אפשרות לחפש בכל השיחות</li>
	<li>תמיכה באמוטיקונים</li>
	<li>צריכת זיכרון ירדה מ20-30מ"ב לפחות מ3מ"ב (מגרסא 0.8 בטא)</li>
	<li>מעבר ל .NET 2.0</li>
	<li>stylesheets שונים להדפסה והצגה.</li>
</ol> 

<h2>שאלות נפוצות</h2>
<dl>
<dt>1. מה עם ממשק המשתמש?</dt>
	<dd><p><b>סיבה 1:</b> רציתי לעשות משהו אחר ומגניב. הממשק הוובי אין. ממשק חלונות הוא אאוט.</p>
	<p><b>סיבה 2:</b> זה יותר פרקטי. העבודה שלי כרוכה בכתיבת קוד של התכנה עצמה. כתבתי יותר ספריות מאשר ממשק משתמש..תכנות חלונות, ובעיקר תכנות ממשק משתמשלא מפריד בין הלוגיקה לתצוגה.. כבר <i>המון</i> זמן, חיפשתי דרך לטפל בבעיה הזאת. תוצאות סופיות? זה עדיין לא זה אבל אני אגיע לשם.</p></dd>
<dt>2. היי, למה אני חייב להשתמש בדפדפן שלי? האם המידע שלי בטוח?</dt>
	<dd><p>התכנה לא נגשת לאינטרנט. הכל נעשה באופן מקומי. Yammy מריץ webserver קטן. כך שהגישה למידע תעשה רק דרך המחשב שלך. משתמשים <b>לא יכולים</b> לגשת לYammy ממכונה מרוחקת.</p>
	<p>והדפדפן? האם הוא מציג את המידע. אם אתה באמת פרנואיד את יכול למחוק את קבצי המטמון וההיסטוריה של הדפדפן.</p></dd>
<dt>3. האם אני יכול להתחבר לחשבון אחר משלי?</dt>
	<dd><p>לא. אבל אתה יכול לראות שיחות שנמצאות בארכיב על מחשבך. ה אומר שאתה יכול להשתמש בYammy (בדר כלשהי) לנטר את ילדיך על ידי יצירת ארכיבים של השיחות שלהם.</p>
	<p>תראה, ביקשת עוגה וקיבלת לחם. אם אתה באמת מחפש תכנה לניטור שיחות ברשת, תן מבט ב<a href="http://imsniffer.sourceforge.net/" title="im sniffer">Im-Sniffer</a>.</p></dd>
<dt>4. When I try to start Yammy I get, 'The application failed to initialize properly'.</dt>
	<dd><p>תצטרך להוריד ולהתקין את  <a href="http://www.microsoft.com/downloads/details.aspx?FamilyID=0856eacb-4362-4b0d-8edd-aab15c5e04f5&displaylang=en" title=".net 2.0 runtime">.NET 2.0 Runtime</a>.</p></dd>
<dt>5. כשאני מחפש, אני מקבל תקלה "אינדקס לא נמצא".</dt>
	<dd><p>האינדקס לא נוצר עדיין. נסה מאוחר יותר. אם זה עדיין קורה, אז יש בעייה. בקר ב<a href="http://yammy.sf.net/forums" title="בקר בפורום">פורומים</a> או <a href="mailto:pravinp@gmail.com" title="צור איתי קשר">צור איתי קשר</a>.</p></dd>
<dt>6. כשאני מדפיס זה נראה שונה</dt>
	<dd><p>יש לי תצורה שונה להדפסה. ולכן הצבעים המיוחדים והרקע אינם אם אתה רוצה, מאיזו שהיא סיבה, להדפיס עם כל הצבעים והרקע, תעתיק את . <code>display.css</code> ל <code>print.css</code>.</p></dd>
<dt>7. למה האייקונים למשתמשים רחוקים נראה תמיד אותו דבר?</dt>
	<dd><p>עוד לא גיליתי איך לקחת את האייקון של משתמשים רחוקים. בינתיים, כולם נראים כך:<br /><img src="/images/generic.png"width="48" height="48" /></p></dd>
<dt>8. אני לא משתמש מרוחק. האייקון שלי נראה זהה!</dt>
	<dd><p>זה מאחר ולא הגדרת לעצמך עדיין תמונה. הגדר אותה ונסה שוב.</p></dd>
</dl>

<p>אם זה לא עזר, <a href="http://yammy.sf.net/forums" title="בקר בפורומים">בקר בפורומים</a> ושלח את שאלתך.</p> 

<h2>תודה</h2>
פרוייקט הוא לא רק חבורה של מתכנתים. אלו המשתמשים שנעזרים בתוכנה ונותנים לנו השראה לעשות עוד. אני רוצה להודות למספר אנשים שגרמו לפרויקט הזה לקרות,
<dl>
<dt>אנדריי וירלן</dt>
	<dd>על כך שנתן את הדחיפה הראשונית. הוא הסיבה לתמיכה בכל השפות.</dd>
<dt>לאורניטה ניקולה (GrayShade)</dt>
	<dd>על כך שהיה שם. אני באמת מתכוון לכך. ועל כך שעזר למשתמשים בבעיותיהם כשלא הייתי כאן.</dd>
<dt>HeyItsMe</dt>
	<dd>על כך שהמריץ אותי לקום ולהוציא כבר גרסא. הייתי מפסיק ב0.7 אילמלא הוא. וגם על הרעיונות שלו ובקשותיו . הוא היה ללא כל ספק המשתמש הכי פעיל.</dd>
</dl>

<em>(תורגם לעברית ע"י גל גפני)</em>